create table yingpian(
    movie_id int primary key auto_increment comment '影片id',
    movie_url varchar(255) not null comment '影片路径'

);

create table massage(
    massage_id int primary key auto_increment comment '信息id',
    massage_names varchar(255) not null comment '影片名字',
    massage_score float(5,2)  comment '影片评分',
    massage_look int comment '影片想看',
    massage_long int not null comment '影片时长',
    massage_type varchar(255) not null comment '影片类型',
    massage_actor varchar(255) not null comment '影片主演',
    movie_id int
);

create table times(
    time_id int primary key auto_increment comment '影片观影时间表',
    time_date varchar(255) not null comment '影片观影日期',
    movie_id int
);

create table projection(
    projection_id int primary key auto_increment comment '影片放映id',
    projection_time varchar(255) not null comment '影片放映时间',
    projection_over varchar(255) not null comment '影片散场时间',
    projection_language varchar(255) not null comment '影片放映语言',
    projection_rooms varchar(255) not null comment '影片放映厅',
    projection_pay float(5,2) not null comment '影片场次价格',
    movie_id int
    -- time_id int
);


insert into yingpian values
(null,'/images/moviechoose/pikaququ.jpg'),
(null,'/images/moviechoose/fuchouzhezhe.jpg'),
(null,'/images/moviechoose/heyiweijia.jpg'),
(null,'/images/moviechoose/gelasi.png'),
(null,'/images/moviechoose/mothers.jpg'),
(null,'/images/moviechoose/haididi.jpg'),
(null,'/images/moviechoose/dogs.jpg'),
(null,'/images/moviechoose/shuangsheng.jpg'),
(null,'/images/moviechoose/longzhu.jpg');


insert into massage values
(null,'大侦探皮卡丘',8.5,null,104,'冒险','瑞安·雷诺兹',1),
(null,'复仇者联盟4：终局之战',9.1,null,181,'动作','小罗伯特·唐尼',2),
(null,'何以为家',9.3,null,116,'剧情',' 赞恩·阿尔·拉菲亚',3),
(null,'哥斯拉2：怪兽之王',null,222126,132,'科幻','米莉·波比·布朗',4),
(null,'一个母亲的复仇',9.3,null,146,'剧情','希里黛玉,阿克夏耶·坎纳',5),
(null,'海蒂和爷爷',null,null,111,'剧情','阿努克·斯特芬',6),
(null,'一条狗的使命2',null,null,108,'剧情','丹尼斯·奎德',7),
(null,'双生',null,162380,82,'悬疑','陈都灵,刘昊然,赵芮',8),
(null,'龙珠超：布罗利',null,49750,100,'动画','野泽雅子,堀川亮,中尾隆圣',9);

insert into times values
(null,'今天5月18日',1),
(null,'明天5月19日',1),
(null,'周一5月20日',1),
(null,'今天5月18日',2),
(null,'明天5月19日',2),
(null,'周一5月20日',2),
(null,'今天5月18日',3),
(null,'明天5月19日',3),
(null,'周一5月20日',3),
(null,'今天5月18日',4),
(null,'明天5月19日',4),
(null,'周一5月20日',4),
(null,'今天5月18日',5),
(null,'明天5月19日',6),
(null,'周一5月20日',7),
(null,'今天5月18日',7),
(null,'明天5月19日',7),
(null,'周一5月20日',8),
(null,'今天5月18日',8),
(null,'明天5月19日',9),
(null,'周一5月20日',9),
(null,'今天5月18日',9);





insert into projection values
-- 皮卡丘
(null,'12:15','13:59散场','国语3D','4号厅(激光)',28.9,1),
(null,'14:15','15:59散场','国语3D','4号厅(激光)',28.9,1),
(null,'17:00','18:44散场','英语3D','1号厅(激光)',28.9,1),
(null,'19:00','20:44散场','英语3D','1号厅(激光)',28.9,1),
(null,'21:00','22:44散场','英语3D','1号厅(激光)',28.9,1),
(null,'15:05','14:49散场','英语3D','1号厅(激光)',28.9,1),
(null,'17:05','18:49散场','英语3D','1号厅(激光)',28.9,1),
(null,'19:00','20:44散场','国语3D','1号厅(激光)',28.9,1),
(null,'21:00','22:44散场','英语3D','1号厅(激光)',28.9,1),
(null,'15:05','16:49散场','英语3D','1号厅(激光)',28.9,1),
(null,'17:05','18:49散场','英语3D','4号厅(激光)',28.9,1),
(null,'19:00','20:44散场','英语3D','1号厅(激光)',28.9,1),
(null,'21:00','22:44散场','英语3D','1号厅(激光)',28.9,1),

-- 复仇者联盟
(null,'13:45','16:46散场','英语3D','1号厅(激光)',28.9,2),
(null,'17:25','20:26散场','英语3D','3号厅(激光)',28.9,2),
(null,'11:50','14:51散场','英语3D','1号厅(激光)',28.9,2),
(null,'15:10','18:11散场','英语3D','3号厅(激光)',28.9,2),
(null,'11:50','14:51散场','英语3D','1号厅(激光)',28.9,2),
(null,'15:10','18:11散场','英语3D','3号厅(激光)',28.9,2),
-- 何以
(null,'15:15','17:11散场','原版2D','3号厅(激光)',23.9,3),
(null,'16:30','18:26散场','原版2D','5号厅(激光)',23.9,3),
-- 哥
(null,'12:25','14:37散场','英语3D','1号厅(激光)',28.9,4),
(null,'14:50','17:02散场','英语3D','1号厅(激光)',28.9,4),
(null,'17:15','19:27散场','英语3D','1号厅(激光)',28.9,4),
(null,'19:40','21:52散场','英语3D','1号厅(激光)',28.9,4),
(null,'12:25','14:37散场','英语3D','1号厅(激光)',28.9,4),
(null,'14:50','17:02散场','英语3D','1号厅(激光)',28.9,4),
(null,'17:15','19:27散场','英语3D','1号厅(激光)',28.9,4),
(null,'19:40','21:52散场','英语3D','1号厅(激光)',28.9,4),
(null,'12:25','14:37散场','英语3D','1号厅(激光)',28.9,4),
(null,'14:50','17:02散场','英语3D','1号厅(激光)',28.9,4),
(null,'17:15','19:27散场','英语3D','1号厅(激光)',28.9,4),
(null,'19:40','21:52散场','英语3D','1号厅(激光)',28.9,4),
-- 
(null,'12:40','15:06散场','国语2D','2号厅(激光)',23.9,5),
(null,'18:40','21:06散场','国语2D','5号厅(激光)',23.9,5),
-- 海蒂和
(null,'16:15','18:06散场','国语2D','4号厅(激光)',23.9,6),
-- 狗的
(null,'12:25','14:13散场','英语2D','5号厅(激光)',34.9,7),
(null,'14:30','16:18散场','英语2D','5号厅(激光)',34.9,7),
(null,'15:20','17:08散场','英语2D','2号厅(激光)',34.9,7),
(null,'17:20','19:08散场','英语2D','2号厅(激光)',34.9,7),
(null,'18:20','20:08散场','英语2D','4号厅(激光)',34.9,7),
(null,'19:20','21:08散场','英语2D','2号厅(激光)',34.9,7),
(null,'20:20','22:08散场','英语2D','4号厅(激光)',34.9,7),
(null,'21:20','23:08散场','英语2D','2号厅(激光)',34.9,7),
(null,'09:40','11:28散场','英语2D','2号厅(激光)',34.9,7),
(null,'11:40','13:28散场','英语2D','5号厅(激光)',34.9,7),
(null,'13:40','15:28散场','英语2D','2号厅(激光)',34.9,7),
(null,'15:40','17:28散场','英语2D','2号厅(激光)',34.9,7),
(null,'17:40','19:28散场','英语2D','4号厅(激光)',34.9,7),
(null,'19:40','21:28散场','英语2D','2号厅(激光)',34.9,7),
(null,'21:40','23:28散场','英语2D','4号厅(激光)',34.9,7),
(null,'09:40','11:28散场','英语2D','2号厅(激光)',34.9,7),
(null,'11:40','13:28散场','英语2D','5号厅(激光)',34.9,7),
(null,'13:40','15:28散场','英语2D','2号厅(激光)',34.9,7),
(null,'15:40','17:28散场','英语2D','2号厅(激光)',34.9,7),
(null,'17:40','19:28散场','英语2D','4号厅(激光)',34.9,7),
(null,'19:40','21:28散场','英语2D','2号厅(激光)',34.9,7),
(null,'21:40','23:28散场','英语2D','4号厅(激光)',34.9,7),
-- 
(null,'10:15','11:37散场','国语2D','1号厅(激光)',28.9,8),
(null,'11:25','12:47散场','国语2D','3号厅(激光)',28.9,8),
(null,'18:25','19:47散场','国语2D','3号厅(激光)',28.9,8),
(null,'20:00','21:22散场','国语2D','3号厅(激光)',28.9,8),
(null,'10:15','11:37散场','国语2D','1号厅(激光)',28.9,8),
(null,'11:25','12:47散场','国语2D','3号厅(激光)',28.9,8),
(null,'18:25','19:47散场','国语2D','3号厅(激光)',28.9,8),
-- 
(null,'17:25','19:05散场','日语2D','2号厅(激光)',23.9,9);
